---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.NoneOfSelElemsGroupable
source: html/e80cf713-2cd9-51b0-6b6b-4bb06ee7ee69.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.NoneOfSelElemsGroupable Property

None of the selected elements can be grouped. The elements may already be grouped or may be element types which are not allowed for grouping.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoneOfSelElemsGroupable { get; }
```